const header = [
  { name: "Обо мне", id: "1" },
  { name: "Меню", id: "2" },
  { name: "Главная", id: "3" },
  { name: "Контакты", id: "4" },
];

export const galleryForAnime = [
  {
    id: "5",
    src: "./src/components/Photos/Mi8cTZvAyiI.jpg",
    name: "В лес, где мерцают светлячки",
  },
  {
    id: "6",
    src: "./src/components/Photos/720d57aa42.jpg",
    name: "Токийский гуль",
  },
  {
    id: "7",
    src: "./src/components/Photos/start.jpg",
    name: "5 сантиметров в секунду",
  },
  {
    id: "8",
    src: "./src/components/Photos/4_1584545206.jpg",
    name: "Затерянная деревня",
  },
  {
    id: "9",
    src: "./src/components/Photos/0fb6c823f4b2f84d036a28110d483.jpeg",
    name: "Стальной Алхимик",
  },
];

const galleryForDunhua = [
  {
    id: "10",
    src: "./src/components/Photos/Face-on-Lie-anime-650x361.jpg",
    name: "Лицом ко лжи",
  },
  {
    id: "11",
    src: "./src/components/Photos/Без названия (1).jpg",
    name: "Она много лет не была главной героиней",
  },
  {
    id: "12",
    src: "./src/components/Photos/pr-8.jpg",
    name: "Практикуя ци сто тысяч лет",
  },
  {
    id: "13",
    src: "./src/components/Photos/1682422610_zjat-850.jpg",
    name: "Зять",
  },
  {
    id: "14",
    src: "./src/components/Photos/1665757281_anistar.org-qi-refining-for-3000-years-tv-1-01.png",
    name: "Три тысячи лет постигая ци",
  },
];

const galleryForManhwa = [
  {
    id: "15",
    src: "./src/components/Photos/8db47cf5-4e5e-403e-85d1-abf8229add6d.png",
    name: "Будучи мачехой легко избежать смерти",
  },
  {
    id: "16",
    src: "./src/components/Photos/a619c289-d38c-4bdb-975d-ac623825f01e.png",
    name: "Несомненно твой",
  },
  {
    id: "17",
    src: "./src/components/Photos/PR5_BoP1cNA.jpg",
    name: "Выжить в качестве жены героя",
  },
  {
    id: "18",
    src: "./src/components/Photos/vfXIN0zmpwc.jpg",
    name: "Я так и не смогла усмирить эту злую натуру",
  },
  {
    id: "19",
    src: "./src/components/Photos/DV2FRhU6AVak3Gz-MZjcwh-B476IAtPUY54TBO1tDH6nxf3t8e5AS-XyC_UaSBtlm5Kj1coUBias-k3pAWOmIPC3.jpg",
    name: "Фальшивая герцогиня",
  },
];

const sourcesOfAnime = [
  {
    source:
      "https://ru.wikipedia.org/wiki/%D0%90%D0%BD%D0%B8%D0%BC%D0%B5#%D0%98%D1%81%D1%82%D0%BE%D1%80%D0%B8%D1%8F",
    name: "Википедия",
  },
  {
    source: "https://www.rbc.ru/life/news/645ced019a7947b27c673526",
    name: "Сайт РБК Лайф",
  },
  {
    source:
      "https://ru.freepik.com/free-photo/girl-with-backpack-sunset-generative-al_38937974.htm#fromView=search&page=1&position=1&uuid=5dc7b685-bfae-4eeb-a973-106a7e7e80b5",
    name: "Фото девушки с ранцом на спине - Изображение от pvproductions на Freepik",
  },
  {
    source:
      "https://ru.wikipedia.org/wiki/%D0%90%D0%BD%D0%B8%D0%BC%D0%B5#%D0%98%D1%81%D1%82%D0%BE%D1%80%D0%B8%D1%8F",
    name: "Фото девушка в голубом - Изображение от freepik",
  },
];
const sourcesOfManhwa = [
  {
    source:
      "https://www.chitai-gorod.ru/articles/manga_mankhva_i_mankhua_v_chem_raznitsa-3963",
    name: "Сайт Читай-Москва",
  },
  {
    source:
      "https://ru.wikipedia.org/wiki/%D0%9C%D0%B0%D0%BD%D1%85%D0%B2%D0%B0",
    name: "Википедия",
  },
  { name: "Фото взяты с Интернета" },
];
const sourcesOfDunhua = [
  {
    source:
      "https://ru.wikipedia.org/wiki/%D0%90%D0%BD%D0%B8%D0%BC%D0%B0%D1%86%D0%B8%D1%8F_%D0%B2_%D0%9A%D0%B8%D1%82%D0%B0%D0%B5",
    name: "Википедия",
  },
  {
    source:
      "https://thegirl.ru/articles/kitaiskoe-anime-chto-takoe-dunkhua-i-chem-ono-otlichaetsya-ot-yaponskoi-animacii/",
    name: "Журнал The Girl",
  },
  { name: "Фото взяты с Интернета" },
];

const photosForGreetingBlockAnime = [
  {
    source:
      "src/components/Photos/anime-style-portrait-traditional-japanese-samurai-character(1).jpg",
  },
  {
    source:
      "src/components/Photos/anime-style-portrait-traditional-japanese-samurai-character.jpg",
  },
  {
    source: "src/components/Photos/girl-with-backpack-sunset-generative-al.jpg",
  },
];
const photosForGreetingBlockDunhua = [
  { source: "src/components/Photos/080a00bd4b.png" },
  { source: "src/components/Photos/dd66ce50af1b0db5c0453fd7e31f1b13.jpg" },
  { source: "src/components/Photos/cbded926b5077087ef017646b6813812.jpg" },
];

const photosForGreetingBlockManhwa = [
  { source: "src/components/Photos/scale_1200.jpg" },
  { source: "src/components/Photos/photo_2024-09-21_17-01-52.jpg" },
  { source: "src/components/Photos/photo_2024-09-21_17-01-54.jpg" },
];
const featuresOfAnime = [
  {
    title: "Глаза",
    feature:
      "У всех персонажей большие глаза, которые детально прорисованы в отличие от других частей лица.",
  },
  {
    title: "Внешность и характер",
    feature:
      "О характере персонажа обычно свидетельствуют и другие атрибуты внешности, например, одежда и волосы",
  },
  {
    title: "Передача эмоций",
    feature:
      "Эмоции могут изображаться подчёркнуто нереалистично, гипертрофированно — персонажи говорят с закрытыми глазами, чтобы передать безапелляционность, или принимают картинно демонический вид, когда проявляют гнев. В комедийных ситуациях, с целью показать несерьёзность чувства, применяются пиктограммы, такие, как картинка «капельки пота» или «вздувшихся вен», возникающие поверх головы героя, либо в рамочке над ней.",
  },
];

const featuresOfDunhua = [
  {
    title: "Фольклор",
    feature:
      "Фольклора и переосмысления легенд в дунхуа даже больше, чем в японской анимации. Любят китайцы свою культуру, что тут скажешь. Причем, что китайские дорамы, что дунхуа поражают размахом фэнтези-сеттинга и количеством персонажей.",
  },
  {
    title: "Рисовка",
    feature:
      "Рисовка тоже отличается: легко заметить, что в дунхуа те же глаза героев несколько уже, чем у японцев (независимо от того, милый герой или нет). Иногда изображение героев может вгонять в ступор своей карикатурностью, но этому есть две причины: либо бюджет у дунхуа небольшой, либо стиль такой. Впрочем, в этом японская и китайская анимация скорее похожи.",
  },
  {
    title: "Цензура",
    feature:
      "Цензура. Да, без нее в Китае никак. Из-за нее дунхуа, нарисованные по манхуа, частенько лишаются «смущающих» элементов, которые можно с легкостью найти в аниме.",
  },
];

const featuresOfManhwa = [
  {
    title: "Способ чтения",
    feature:
      "Главное различие между этими видами комиксов в их прочтении. Традиционно мангу и маньхуа читают справа налево. Манхва же ближе к европейским и американским стандартам, поэтому читается слева направо.",
  },
  {
    title: "Цвет печати",
    feature:
      "Манхва в печати в основном остаются чёрно-белыми, но на просторы интернета её выкладывают в цветном варианте.",
  },
  {
    title: "Стиль",
    feature:
      "Японские мангаки следуют традициям, заложенным Осаму Тэдзукой, и рисуют героев с большими глазами, аккуратными носами и губами, преувеличенными изображениями лиц для подчёркивания эмоций. Впрочем, рисовка определённой манги зависит от стиля её автора – встречаются и вполне реалистичные работы, например манга «Берсерк» Кэнтаро Миуры.",
  },
];
const historyOfAnime = [
  {
    history:
      "История аниме берёт начало в XX веке, когда японские кинорежиссёры начинают первые эксперименты с техниками мультипликации, изобретёнными на Западе. Старейшая из известных сохранившихся японских анимаций — «Katsudo Shashin» длится всего 3 секунды. Одним из самых первых аниме стал продемонстрированный в 1917 году двухминутный комедийный фильм «Namakura Gatana», в котором самурай собирается испытать свой новый меч, но терпит поражение от горожанина. Одним из наиболее популярных и доступных методов на тот момент была техника вырезной анимации. Позднее распространилась также техника аппликационной анимации. Успеха в развитии техники анимации добились и другие мультипликаторы, использовавшие, в частности, анимационные фильмы в образовательных и пропагандистских целях. Первым звуковым аниме стал снятый Масаокой в 1933 году короткометражный фильм Chikara to Onna no Yo no Naka. К 1940 году начали образовываться организации мультипликаторов и художников.",
  },
  {
    history:
      "Основоположником традиций современного аниме стал Осаму Тэдзука — он заложил основы того, что позднее преобразовалось в современные аниме-сериалы. Например, Тэдзука  заимствовал у Диснея и развил манеру использования больших глаз персонажей для передачи эмоций; именно под его руководством возникали первые произведения, которые можно отнести к ранним аниме.",
  },
  {
    history:
      'Сейчас первенство в аниме индустрии занимает режиссерка и сценаристка Мари Окада, которая создала такие произведения, как "Укрась прощальное утро цветами обещания", "Фабрика иллюзий Алисы и Террезы", "Затерянная деревня", "Она видела небо".',
  },
];
const historyOfDunhua = [
  {
    history:
      "История анимации в Китае началась в 1918 году, когда в Шанхай из США был завезен анимационный фильм под названием «Из чернильницы». Фрагменты мультфильмов были впервые использованы в рекламах отечественной продукции.",
  },
  {
    history:
      "Тем не менее, анимационная индустрия начала своё развитие лишь с приездом братьев Ванов в 1926 году. С первого звукового фильма «Танец верблюда» и до первой полноценной мультипликационной ленты «Принцесса Железный Веер» Китай шёл в ногу с остальными странами мира.",
  },
  {
    history:
      "Однако золотой век китайской анимации завершился, когда Коммунистическая партия Китая во главе с Мао Цзэдуном провела Культурную революцию. Многие художники-мультипликаторы были вынуждены уехать. Если не суровые экономические условия, то плохое обращение со стороны хунвэйбинов угрожали их работе. Оставшиеся мультипликаторы все больше склонялись к пропаганде.",
  },
  {
    history:
      "К 1980-м годам Япония стала центром мультипликации на Дальнем Востоке, оставив индустрию Китая позади по своей репутации и производительности. Но в 1990-х годах произошли две значительные перемены. Во-первых, это политические изменения. На смену плановому хозяйству пришла социалистическая рыночная экономика. Один человек уже не мог ограничить выпуск продукции и прибыль индустрии. Во-вторых, это технологические изменения, связанные с появлением Интернета. Возникли новые возможности у флэш-аниматоров, а также содержание фильма теперь стало более свободным.",
  },
  {
    history:
      "В настоящее время китайская анимация радикально изменяется под влиянием Гонконга и Тайваня.",
  },
];

const historyOfManhwa = [
  {
    history:
      "Корейская манхва очень похожа на японскую мангу и китайскую маньхуа. Они имеют много общих черт, но каждая обладает собственными особенностями: текст и графика согласуются с культурой и историей соответствующих стран. Манхва находилась под влиянием тяжёлой новейшей истории Кореи, это повлияло на многообразие форм и жанров. Отталкиваясь от основного течения, копирующего особенности манги, манхва развилась до авторских мини-историй, графически ориентированных работ и манхва-сериалов, распространяемых через интернет. На данный момент длинные сериалы интернет-манхвы на специальных порталах (например Media Daum) и личных страничках являются популярным ресурсом среди молодого поколения Южной Кореи.",
  },
  {
    history:
      "Под манхвой обычно подразумеваются комиксы Южной Кореи, однако существуют и комиксы Северной Кореи.",
  },
  {
    history:
      "Манхва читается в том же направлении, что и книги на русском языке — горизонтально слева направо, так как текст на хангыле обычно пишется именно так, хотя иногда он может быть записан так же как японский и китайский — вертикально справа налево. Оба варианта читаются сверху вниз.",
  },
  {
    history:
      "В отличие от Японии, анимация, основанная на манхве, в Республике Корее всё ещё редка (несколько заметных хитов в конце 80-х и начале 90-х — Dooly the Little Dinosaur и Fly! Superboard). Однако, манхва в последние годы часто экранизируется в телесериалы и фильмы: Full House (2004) и Goong (2006) — примеры лучших телесериалов такого рода за последнее время.",
  },
];
const genresOfAnime = [
  {
    title: "Сёдзё",
    genre:
      "метажанр, который определяется по возрастной категории аудитории. Аниме и манга предназначены для девочек от 12 до 18 лет. Чаще всего вторичными жанрами выступают романтика, повседневность, меха-сёдзё, комедия и фэнтези. Примеры: «Хост-клуб Оранской школы» (2006), «Торадора!» (2008), «Корзинка фруктов» (2019–2021).",
  },
  {
    title: "Сёнэн",
    genre:
      "метажанр, который определяется по возрастной категории аудитории. Аниме и манга предназначены для юношей от 12 до 18 лет. Чаще всего метажанр идет в компании с привычными стилями — фэнтези, экшеном и драмой. Примеры: «Наруто» (2002–2007), «Блич» (2004 — настоящее время), «МАГИЧЕСКАЯ БИТВА» (2020 — настоящее время).",
  },
  {
    title: "Меха",
    genre:
      "Главный атрибут этого жанра — изображение боевых роботов. Чаще всего в аниме и манге показано противостояние людей и машин. Примеры: «Мобильный воин Гандам» (1979–1980), «Евангелион» (1995–1996), «86» (2021).",
  },
  {
    title: "Махо-сёдзё",
    genre:
      "аниме и манга про молодых девушек со сверхспособностями, обычно волшебниц. Примеры: «Сейлор Мун» (1992–1997), Cardcaptor Sakura (1998–2000), Pretty Cure (2005–2006).",
  },
  {
    title: "Сэйнэн",
    genre:
      "метажанр, который определяется по возрастной категории аудитории. Аниме и манга предназначены для мужчин от 18 лет и старше. Обычно совмещается с такими жанрами, как триллер, экшен, фэнтези и драма. Примеры: «Берсерк» (1997), «Монстр» (2004), «Золотой Камуй» (2018 — настоящее время).",
  },
  {
    title: "Дзёсэй",
    genre:
      "метажанр, который определяется по возрастной категории аудитории. Аниме и манга предназначены для женщин от 18 лет и старше. Главными вторичными жанрами являются драма, романтика и повседневность. Примеры: __«Яркая Тихая» (2011 — настоящее время), Sakamichi no Apollon (2012), «Убийственная любовь» (2022).",
  },
  {
    title: "Исекай",
    genre:
      "фэнтези-жанр, где герои переносятся в другой мир или в отличную временную петлю. Примеры: «Re: Zero — жизнь с нуля в другом мире» (2016 — настоящее время), «О моем перерождении в слизь» (2018 — настоящее время), «Mushoku Tensei: Перерождение безработного» (2021 — настоящее время).",
  },
  {
    title: "Повседневность («ломтик жизни»)",
    genre:
      "жанр, где в центре сюжета бытовые будни главных героев, и там ничего не происходит. Примеры: K-on! (2009–2010), «Уютный поход» (2018–2021), «Двуличный братик Урамити» (2021).",
  },
];

const genresOfDunhua = [
  {
    title: "Традиционная",
    genre:
      "Современная китайская анимация бывает двух типов. Первая — традиционная. За нее отвечают большие корпорации, там много компьютерной графики. Собственно, она аналогична мультфильмам Диснея с точки зрения популярности и системы производства.",
  },
  {
    title: "Веб-мультфильмы",
    genre:
      "Второй тип анимации — веб-мультфильмы. Они не менее популярны, чем традиционные мульты и могут использоваться в качестве рекламы. Еще один большой плюс такой анимации — больше свободы для творчества.",
  },
];

const genresOfManhwa = [
  {
    title: "Мённан манхва",
    genre: "эквивалент кодомо или юмористической манги для любого возраста.",
  },
  { title: "Сонён манхва", genre: "эквивалент сёнэна." },
  {
    title: "Сунджон манхва",
    genre: "эквивалент сёдзё (букв.: о чистых чувствах).",
  },
  { title: "Чхоннён манхва", genre: "эквивалент сэйнэна." },
  {
    title: "Ттакчи манхва",
    genre: "приключенческая манхва, в которой сюжет развивается на западе.",
  },
];
